# IsValidCombinedParameters Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..IsValidCombinedParameters Method
ScheduleField Class See Also
---
Checks if data is valid for combined parameters
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool IsValidCombinedParameters(
	IList<TableCellCombinedParameterData> data
)
```

Visual Basic
---
```text
Public Function IsValidCombinedParameters ( _
	data As IList(Of TableCellCombinedParameterData) _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidCombinedParameters(
	IList<TableCellCombinedParameterData^>^ data
)
```

# ### Parameters
data
    Type: System.Collections.Generic..::..IList<(Of <(<'TableCellCombinedParameterData>)>)> data is array of TableCellCombinedParameterData to be set as combined parameters
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace